# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'gh'
brew 'git'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts

# Development
brew 'nvm'
brew 'python3'
brew 'docker'
brew 'watchman'
cask 'android-sdk'
cask 'android-ndk'
cask 'android-studio'
cask 'flutter'
brew 'GCC'
brew 'libimobiledevice'
brew 'ideviceinstaller'
brew 'ios-deploy'
brew 'cocoapods'

# Apps
cask 'raycast'
cask 'messenger'
brew 'mackup'
cask 'rectangle'
brew 'homebrew/cask-drivers/sonos'
cask 'fork'
cask 'warp'
cask 'studio-3t'
cask 'kap'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'brave-browser'
cask 'postman'
cask 'slack'
cask 'visual-studio-code'
cask 'micosoft-teams'
cask 'zoom'
cask 'spotify'
cask 'hiddenbar'
cask 'iina'
cask 'grammarly-desktop'
cask 'plex'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store
mas 'Bitwarden', id: 1352778147
mas 'Paste', id: 967805235
mas 'Xcode', id: 497799835